// ============================================================================
// 
// Mnkt 共通で使用する定数
// 
// ============================================================================

// ----------------------------------------------------------------------------
//
// ----------------------------------------------------------------------------

using Shinta;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MergeNicoKaraTracks.SharedMisc
{
	// ====================================================================
	// public 列挙子
	// ====================================================================

	// ====================================================================
	// 定数クラス
	// ====================================================================
	public class MnktConstants
	{
		// ====================================================================
		// public 定数
		// ====================================================================

		// --------------------------------------------------------------------
		// アプリの基本情報
		// --------------------------------------------------------------------
		public const String APP_ID = "MergeNicoKaraTracks";
		public const String APP_NAME_J = "ニコカラ動画のオンボとオフボを結合";
		public const String APP_VER = "Ver 1.10";
		public const String COPYRIGHT_J = "Copyright (C) 2019 by SHINTA";

		// --------------------------------------------------------------------
		// ファイル名
		// --------------------------------------------------------------------
		public const String FILE_NAME_MP4BOX = "MP4Box" + Common.FILE_EXT_EXE;

	}
	// public class MnktConstants ___END___
}
// namespace MergeNicoKaraTracks.SharedMisc ___END___
